app/Controllers/BaseController.php

    public function load_company_setting($companyid = null) {
        $company_id = (is_null($companyid)) ? $this->session->get("user_company_id") : $companyid;
        $query = $this->db->table('settings')
                ->select('settings.*')
                ->where("company_id", $company_id)
                ->get();
        if ($query->getNumRows() == 1) {
            return $query->getRow();
---
SELECT `settings`.*
FROM `settings`
WHERE `company_id` = '1'
SELECT *
FROM `settings`
WHERE `company_id` = '1'

    public function load_backend_view($view_name, $view_data = array()) {
        /////
        $header_data['session'] = $this->session;
        $cnt = $this->db->table('sys_menu mlc')->select('count(*)')
                ->where("mlc.idParent = m.id and mlc.isActivated = 1")
                ->getCompiledSelect();
        $query = $this->db->table('sys_menu m')->select("m.*, m.code as titremenu,($cnt) as n")
                ->join("sys_user_profile_menu p", "p.idMenu = m.id", "inner")
                ->where("m.isActivated", 1)
                ->where("p.idProfile", $this->session->get("user_profile"))
                ->orderBy('orderBy')
                ->get();
---
SELECT `m`.*, `m`.`code` as `titremenu`, (SELECT count(*)
FROM `sys_menu` `mlc`
WHERE `mlc`.`idParent` = `m`.`id` and `mlc`.`isActivated` = 1) as n
FROM `sys_menu` `m`
INNER JOIN `sys_user_profile_menu` `p` ON `p`.`idMenu` = `m`.`id`
WHERE `m`.`isActivated` = 1
AND `p`.`idProfile` = '0'
ORDER BY `orderBy`