app/Models/HomeModel.php

    public function count_table_wo_dashboard($dd, $df, $situation) {
        return $this->db->table('work_order')
                        ->where("company_id", $this->session->get("user_company_id"))
                        ->where("work_order_created_date >=", $dd)
                        ->where("work_order_created_date <=", $df)
                        ->whereIn("work_order_situation_id", $situation)
                        ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `work_order`
WHERE `company_id` = '1'
AND `work_order_created_date` >= '2022-04-01'
AND `work_order_created_date` <= '2022-05-01'
AND `work_order_situation_id` IN (1,2,3,4,5,6)

    public function wr_backlog_n($dd, $df) {
        return $this->db->table('work_request')
                        ->join('cost_center', 'cost_center.cost_center_id = work_request_cost_center_id', 'inner')
                        ->where("work_request.company_id", $this->session->get("user_company_id"))
                        ->where("work_request_created_date >=", $dd)
                        ->where("work_request_created_date <=", $df)
                        ->whereIn("work_request_situation_id", [1, 2, 3, 4, 5, 6, 7, 8])
                        ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `work_request`
INNER JOIN `cost_center` ON `cost_center`.`cost_center_id` = `work_request_cost_center_id`
WHERE `work_request`.`company_id` = '1'
AND `work_request_created_date` >= '2022-04-01'
AND `work_request_created_date` <= '2022-05-01'
AND `work_request_situation_id` IN (1,2,3,4,5,6,7,8)

    public function wo_backlog_n($dd, $df) {
        return $this->db->table('work_order')
                        ->join('cost_center', 'cost_center.cost_center_id = work_order_cost_center_id', 'inner')
                        ->where("work_order.company_id", $this->session->get("user_company_id"))
                        ->where("work_order_created_date >=", $dd)
                        ->where("work_order_created_date <=", $df)
                        ->whereIn("work_order_situation_id", [1, 2, 3, 4, 5, 6, 7, 8])
                        ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `work_order`
INNER JOIN `cost_center` ON `cost_center`.`cost_center_id` = `work_order_cost_center_id`
WHERE `work_order`.`company_id` = '1'
AND `work_order_created_date` >= '2022-04-01'
AND `work_order_created_date` <= '2022-05-01'
AND `work_order_situation_id` IN (1,2,3,4,5,6,7,8)

    public function wo_get_cout_par_type_cout() {
        $dd = gmdate('Y-m-d', strtotime('first day of last month'));
        $df = gmdate('Y-m-d', strtotime('+ 1 days', strtotime('last day of last month')));
        return $this->db->table('work_order')
                ->select("SUM(IFNULL(work_order_labour_cost,0)) as labour_cost, SUM(IFNULL(work_order_item_cost,0)) as item_cost, SUM(IFNULL(work_order_invoice_cost,0)) as invoice_cost ")
                ->where('work_order.work_order_end_date  >=', $dd)
                ->where('work_order.work_order_end_date  <=', $df)
                ->where("company_id", $this->session->get("user_company_id"))
                ->get()->getResult();
---
SELECT SUM(IFNULL(work_order_labour_cost, 0)) as labour_cost, SUM(IFNULL(work_order_item_cost, 0)) as item_cost, SUM(IFNULL(work_order_invoice_cost, 0)) as invoice_cost
FROM `work_order`
WHERE `work_order`.`work_order_end_date` >= '2022-04-01'
AND `work_order`.`work_order_end_date` <= '2022-05-01'
AND `company_id` = '1'

    public function wo_get_cout_par_type_intervention() {
        $dd = gmdate('Y-m-d', strtotime('first day of last month'));
        $df = gmdate('Y-m-d', strtotime('+ 1 days', strtotime('last day of last month')));
        return $this->db->table('work_order')
                ->join('nature', 'nature.nature_id = work_order.work_order_nature_id', "inner")
                ->select("nature.nature_category, SUM(IFNULL(work_order_labour_cost,0)+ IFNULL(work_order_item_cost,0)+ IFNULL(work_order_invoice_cost,0)) as amount")
                ->groupBy('nature.nature_category')
                ->where('work_order.work_order_end_date >=', $dd)
                ->where('work_order.work_order_end_date <=', $df)
                ->where("work_order.company_id", $this->session->get("user_company_id"))
                ->get()->getResult();
---
SELECT `nature`.`nature_category`, SUM(IFNULL(work_order_labour_cost, 0)+ IFNULL(work_order_item_cost, 0)+ IFNULL(work_order_invoice_cost, 0)) as amount
FROM `work_order`
INNER JOIN `nature` ON `nature`.`nature_id` = `work_order`.`work_order_nature_id`
WHERE `work_order`.`work_order_end_date` >= '2022-04-01'
AND `work_order`.`work_order_end_date` <= '2022-05-01'
AND `work_order`.`company_id` = '1'
GROUP BY `nature`.`nature_category`

    public function wo_get_cost_by_year($year) {
       return $this->db->table('work_order')
                ->select('date_format(work_order_end_date,"_%m") as mois, SUM(IFNULL(work_order_labour_cost,0)) as item_cost, SUM(IFNULL(work_order_labour_cost,0)) as labour_cost, SUM(IFNULL(work_order_invoice_cost,0)) as invoice_cost')
                ->groupBy('date_format(work_order_end_date,"_%m")')
                ->where("DATE_FORMAT(work_order_end_date,'%Y')", $year)
                ->where("work_order.company_id", $this->session->get("user_company_id"))
                ->get()->getResult();
---
SELECT date_format(work_order_end_date, "_%m") as mois, SUM(IFNULL(work_order_labour_cost, 0)) as item_cost, SUM(IFNULL(work_order_labour_cost, 0)) as labour_cost, SUM(IFNULL(work_order_invoice_cost, 0)) as invoice_cost
FROM `work_order`
WHERE DATE_FORMAT(work_order_end_date,'%Y') = '2022'
AND `work_order`.`company_id` = '1'
GROUP BY date_format(work_order_end_date, "_%m")

    public function get_preventive_rate($dd = null, $df = null) {
        if (is_null($dd) || is_null($df)) {
            $dd = gmdate('Y-m-d', strtotime('first day of last month'));
            $df = gmdate('Y-m-d', strtotime('last day of last month'));
        }

        return $this->db->table('activity')
                ->select("SUM(act_time_spent) AS totaltime_spent")
                ->select("SUM(case when nature.nature_category=1 then act_time_spent else 0 end) as preventivetime")
                ->join('nature', 'nature_id = act_nature_id', 'left')
                ->where('activity.act_end_date >=', $dd)
                ->where('activity.act_end_date <=', $df)
                ->where("activity.company_id", $this->session->get("user_company_id"))
                ->get()->getResult();
---
SELECT SUM(act_time_spent) AS totaltime_spent, SUM(case when nature.nature_category=1 then act_time_spent else 0 end) as preventivetime
FROM `activity`
LEFT JOIN `nature` ON `nature_id` = `act_nature_id`
WHERE `activity`.`act_end_date` >= '2022-04-01'
AND `activity`.`act_end_date` <= '2022-04-30'
AND `activity`.`company_id` = '1'

    public function get_equipement_tmp($limit_length = null, $limit_start = null, $search = '', $orderby = '') {
        $builder = $this->db->table('equipment')
                            ->select("equipment.equip_id as id, concat(equipment.equip_code, ' - ', equipment.equip_designation) equipment, if(user_dashbord_favoris.user_dashbord_favoris_id is null, 0,1) as is_favoris, equip_unavail_rate, equip_mtbf, equip_mttr")
                            ->join('time_table_class', 'time_table_class.time_class_id = equipment.equip_time_class_id', "left")
                            ->join('user_dashbord_favoris', 'user_dashbord_favoris.user_dashbord_favoris_favoris_id = equipment.equip_id and user_dashbord_favoris.user_dashbord_favoris_user_id = ' . $this->session->get("user_id") . ' and user_dashbord_favoris_favoris_id = 4', 'left')
                            ->where("equipment.company_id", $this->session->get("user_company_id"));

        if ($search != '') {
           $builder->group_start()
                    ->like('equipment.equipment', $search, 'both')
                    ->or_like('equipment.designation', $search, 'both')
                    ->group_end();
        }

        if (!is_null($limit_length) && !is_null($limit_start)) {
            $builder->limit($limit_length, $limit_start);
        }

        if ($orderby != '') {
            $builder->orderBy($orderby);
        } else {
            $builder->orderBy("user_dashbord_favoris.user_dashbord_favoris_favoris_id", "desc");
        }

        return $builder->get()->getResult();
---
SELECT `equipment`.`equip_id` as `id`, concat(equipment.equip_code, ' - ', equipment.equip_designation) equipment, if(user_dashbord_favoris.user_dashbord_favoris_id is null, 0, 1) as is_favoris, `equip_unavail_rate`, `equip_mtbf`, `equip_mttr`
FROM `equipment`
LEFT JOIN `time_table_class` ON `time_table_class`.`time_class_id` = `equipment`.`equip_time_class_id`
LEFT JOIN `user_dashbord_favoris` ON `user_dashbord_favoris`.`user_dashbord_favoris_favoris_id` = `equipment`.`equip_id` and `user_dashbord_favoris`.`user_dashbord_favoris_user_id` = 1 and `user_dashbord_favoris_favoris_id` = 4
WHERE `equipment`.`company_id` = '1'
ORDER BY `user_dashbord_favoris`.`user_dashbord_favoris_favoris_id` DESC
 LIMIT 5

     public function get_cout_intervention_par_cc_tmp($limit_length = null, $limit_start = null, $search = '', $orderby = '') {
       $builder = $this->db->table('cost_center')
                        ->select("cost_center.cost_center_id as id, cost_center.cost_center_designation as costcenter, if(user_dashbord_favoris.user_dashbord_favoris_favoris_id is null, 0,1) as is_favoris, tmp_cost_center_cost.tmp_cost_center_cost_labour_cost as labour_cost, tmp_cost_center_cost.tmp_cost_center_cost_item_cost as item_cost, tmp_cost_center_cost.tmp_cost_center_cost_invoice_cost as invoice_cost ")
                        ->join('user_dashbord_favoris', 'user_dashbord_favoris.user_dashbord_favoris_favoris_id = cost_center.cost_center_id and user_dashbord_favoris.user_dashbord_favoris_user_id = ' . $this->session->get("user_id") . ' and user_dashbord_favoris_type_favoris = 3', 'left')
                        ->join('tmp_cost_center_cost', 'tmp_cost_center_cost.tmp_cost_center_cost_cost_center_id = cost_center.cost_center_id', "left")
                        ->where("cost_center.company_id", $this->session->get("user_company_id"));
        if ($search != '') {
            $builder->group_start()
                    ->like('cost_center.cost_center_code', $search, 'both')
                    ->or_like('cost_center.cost_center-designation', $search, 'both')
                    ->group_end();
        }

        if (!is_null($limit_length) && !is_null($limit_start)) {
            $builder->limit($limit_length, $limit_start);
        }

        if ($orderby != '') {
            $builder->orderBy($orderby);
        } else {
            $builder->orderBy("user_dashbord_favoris.user_dashbord_favoris_favoris_id", "desc");
        }
        return $builder->get()->getResult();
---
SELECT `cost_center`.`cost_center_id` as `id`, `cost_center`.`cost_center_designation` as `costcenter`, if(user_dashbord_favoris.user_dashbord_favoris_favoris_id is null, 0, 1) as is_favoris, `tmp_cost_center_cost`.`tmp_cost_center_cost_labour_cost` as `labour_cost`, `tmp_cost_center_cost`.`tmp_cost_center_cost_item_cost` as `item_cost`, `tmp_cost_center_cost`.`tmp_cost_center_cost_invoice_cost` as `invoice_cost`
FROM `cost_center`
LEFT JOIN `user_dashbord_favoris` ON `user_dashbord_favoris`.`user_dashbord_favoris_favoris_id` = `cost_center`.`cost_center_id` and `user_dashbord_favoris`.`user_dashbord_favoris_user_id` = 1 and `user_dashbord_favoris_type_favoris` = 3
LEFT JOIN `tmp_cost_center_cost` ON `tmp_cost_center_cost`.`tmp_cost_center_cost_cost_center_id` = `cost_center`.`cost_center_id`
WHERE `cost_center`.`company_id` = '1'
ORDER BY `user_dashbord_favoris`.`user_dashbord_favoris_favoris_id` DESC
 LIMIT 5