app/Models/LoginModel.php

SELECT `sys_user`.*, `sys_commune`.`designation` as `commune`
FROM `sys_user`
JOIN `sys_commune` ON `sys_commune`.`id` = `sys_user`.`idCommune`
WHERE `login` = 'admin'
AND `pwd` = '21232f297a57a5a743894a0e4a801fc3'
AND `isActivated` = 1
SELECT `sys_user`.*, `sys_commune`.`designation` as `commune`
FROM `sys_user`
JOIN `sys_commune` ON `sys_commune`.`id` = `sys_user`.`idCommune`
WHERE `login` IS NULL
AND `pwd` = 'd41d8cd98f00b204e9800998ecf8427e'
AND `isActivated` = 1
---
    public function authenticate($login, $password) {
        $query = $this->db->table('sys_user')
                ->select('sys_user.*, sys_commune.designation as commune')
                ->join('sys_commune', 'sys_commune.id = sys_user.idCommune')
                ->where('login', $login)
                ->where('pwd', md5($password))
                ->where("isActivated", 1)
                ->get();
        if ($query->getNumRows() == 1) {
            $this->set_user_session($query->getRow());