app/Models/NomenclatureModel.php

SELECT `sector`.*, `country`.`country_code` as `country_code`, `country`.`country_designation` as `country_designation`, `parent`.`sector_code` as `parent_code`, `parent`.`sector_designation` as `parent_designation`
FROM `sector`
LEFT JOIN `country` ON `sector`.`sector_country_id` = `country`.`country_id`
LEFT JOIN `sector` `parent` ON `sector`.`sector_parent_id` = `parent`.`sector_id`
INNER JOIN `user_sector` ON `user_sector`.`user_sector_sector_id` = `sector`.`sector_id`
WHERE `user_sector`.`user_sector_user_id` = '1'
AND `sector`.`company_id` = '1'
AND `sector`.`sector_is_deactivated` = 0
ORDER BY `sector`.`sector_id` DESC
---
    public function fetch_user_sector() {
        return $this->db->table('sector')
                        ->select('sector.*, country.country_code as country_code, country.country_designation as country_designation, parent.sector_code as parent_code, parent.sector_designation as parent_designation')
                        ->join('country', 'sector.sector_country_id = country.country_id', 'left')
                        ->join('sector parent', 'sector.sector_parent_id = parent.sector_id', 'left')
                        ->join('user_sector', 'user_sector.user_sector_sector_id = sector.sector_id', 'inner')
                        ->where("user_sector.user_sector_user_id", $this->session->get("user_id"))
                        ->where("sector.company_id", $this->session->get("user_company_id"))
                        ->where("sector.sector_is_deactivated", 0)
                        ->orderBy('sector.sector_id', 'desc')
                        ->get()->getResult();

SELECT `branch`.*, `country`.`country_code` as `country_code`, `country`.`country_designation` as `country_designation`, `sector`.`sector_code` as `sector_code`, `sector`.`sector_designation` as `sector_designation`, `parent`.`branch_code` as `parent_code`, `parent`.`branch_designation` as `parent_designation`
FROM `branch`
LEFT JOIN `country` ON `branch`.`branch_country_id` = `country`.`country_id`
LEFT JOIN `sector` ON `branch`.`branch_sector_id` = `sector`.`sector_id`
LEFT JOIN `branch` `parent` ON `branch`.`branch_parent_id` = `parent`.`branch_id`
INNER JOIN `user_branch` ON `user_branch`.`user_branch_branch_id` = `branch`.`branch_id`
WHERE `user_branch`.`user_branch_user_id` = '1'
AND `branch`.`company_id` = '1'
AND `branch`.`branch_is_deactivated` = 0
ORDER BY `branch`.`branch_id` DESC
---
    public function fetch_user_branch() {
        return $this->db->table('branch')
                        ->select('branch.*, country.country_code as country_code, country.country_designation as country_designation, sector.sector_code as sector_code, sector.sector_designation as sector_designation, parent.branch_code as parent_code, parent.branch_designation as parent_designation')
                        ->join('country', 'branch.branch_country_id = country.country_id', 'left')
                        ->join('sector', 'branch.branch_sector_id = sector.sector_id', 'left')
                        ->join('branch parent', 'branch.branch_parent_id = parent.branch_id', 'left')
                        ->join('user_branch', 'user_branch.user_branch_branch_id = branch.branch_id', 'inner')
                        ->where("user_branch.user_branch_user_id", $this->session->get("user_id"))
                        ->where("branch.company_id", $this->session->get("user_company_id"))
                        ->where("branch.branch_is_deactivated", 0)
                        ->orderBy('branch.branch_id', 'desc')
                        ->get()->getResult();

SELECT `cost_center`.*, `country`.`country_code` as `country_code`, `country`.`country_designation` as `country_designation`, `analytical_center`.`analytical_code` as `analytical_center_code`, `analytical_center`.`analytical_designation` as `analytical_center_designation`, `branch`.`branch_code` as `branch_code`, `branch`.`branch_designation` as `branch_designation`
FROM `cost_center`
LEFT JOIN `country` ON `cost_center`.`cost_center_country_id` = `country`.`country_id`
LEFT JOIN `analytical_center` ON `cost_center`.`cost_center_analytical_center_id` = `analytical_center`.`analytical_id`
LEFT JOIN `branch` ON `cost_center`.`cost_center_branch_id` = `branch`.`branch_id`
INNER JOIN `user_cost_center` ON `user_cost_center`.`user_cost_center_cost_center_id` = `cost_center`.`cost_center_id`
WHERE `user_cost_center`.`user_cost_center_user_id` = '1'
AND `cost_center`.`company_id` = '1'
AND `cost_center`.`cost_center_is_deactivated` = 0
ORDER BY `cost_center`.`cost_center_id` DESC
---
    public function fetch_user_cost_center() {
        return $this->db->table('cost_center')
                        ->select('cost_center.*, country.country_code as country_code, country.country_designation as country_designation, analytical_center.analytical_code as analytical_center_code, analytical_center.analytical_designation as analytical_center_designation, branch.branch_code as branch_code, branch.branch_designation as branch_designation')
                        ->join('country', 'cost_center.cost_center_country_id = country.country_id', 'left')
                        ->join('analytical_center', 'cost_center.cost_center_analytical_center_id = analytical_center.analytical_id', 'left')
                        ->join('branch', 'cost_center.cost_center_branch_id = branch.branch_id', 'left')
                        ->join('user_cost_center', 'user_cost_center.user_cost_center_cost_center_id = cost_center.cost_center_id', 'inner')
                        ->where("user_cost_center.user_cost_center_user_id", $this->session->get("user_id"))
                        ->where("cost_center.company_id", $this->session->get("user_company_id"))
                        ->where("cost_center.cost_center_is_deactivated", 0)
                        ->orderBy('cost_center.cost_center_id', 'desc')
                        ->get()->getResult();

SELECT `equipment`.`equip_id`, `equipment`.`equip_code`, `equipment`.`equip_designation`, `cost_center_id`, `cost_center_code`, `cost_center_designation`, `branch_id`, `branch_code`, `branch_designation`, `sector_id`, `sector_code`, `sector_designation`
FROM `equipment`
INNER JOIN `cost_center` ON `cost_center`.`cost_center_id` = `equipment`.`equip_cost_center_id`
INNER JOIN `user_cost_center` ON `user_cost_center`.`user_cost_center_cost_center_id` = `equipment`.`equip_cost_center_id`
INNER JOIN `branch` ON `cost_center`.`cost_center_branch_id` = `branch`.`branch_id`
INNER JOIN `sector` ON `sector`.`sector_parent_id` = `branch`.`branch_sector_id`
WHERE `user_cost_center`.`user_cost_center_user_id` = '1'
AND `equipment`.`company_id` = '1'
AND `equipment`.`equip_is_deactivated` = 0
ORDER BY `equipment`.`equip_id` DESC
---
    public function fetch_user_equipment() {
        return $this->db->table('equipment')
                        ->select('equipment.equip_id, equipment.equip_code, equipment.equip_designation, cost_center_id, cost_center_code, cost_center_designation, '
                                . 'branch_id, branch_code, branch_designation, sector_id, sector_code, sector_designation ')
                        ->join('cost_center', 'cost_center.cost_center_id = equipment.equip_cost_center_id', 'inner')
                        ->join('user_cost_center', 'user_cost_center.user_cost_center_cost_center_id = equipment.equip_cost_center_id', 'inner')
                        ->join('branch', 'cost_center.cost_center_branch_id = branch.branch_id', 'inner')
                        ->join('sector', 'sector.sector_parent_id = branch.branch_sector_id', 'inner')
                        ->where("user_cost_center.user_cost_center_user_id", $this->session->get("user_id"))
                        ->where("equipment.company_id", $this->session->get("user_company_id"))
                        ->where("equipment.equip_is_deactivated", 0)
                        ->orderBy('equipment.equip_id', 'desc')
                        ->get()->getResult();

SELECT `component`.`component_id`, `component`.`component_code`, `component`.`component_designation`, `equipment`.`equip_id`, `equipment`.`equip_code`, `equipment`.`equip_designation`, `cost_center_id`, `cost_center_code`, `cost_center_designation`, `branch_id`, `branch_code`, `branch_designation`, `sector_id`, `sector_code`, `sector_designation`
FROM `component`
INNER JOIN `equipment` ON `equipment`.`equip_id` = `component`.`component_id`
INNER JOIN `cost_center` ON `cost_center`.`cost_center_id` = `equipment`.`equip_cost_center_id`
INNER JOIN `user_cost_center` ON `user_cost_center`.`user_cost_center_cost_center_id` = `equipment`.`equip_cost_center_id`
INNER JOIN `branch` ON `cost_center`.`cost_center_branch_id` = `branch`.`branch_id`
INNER JOIN `sector` ON `sector`.`sector_parent_id` = `branch`.`branch_sector_id`
WHERE `user_cost_center`.`user_cost_center_user_id` = '1'
AND `equipment`.`company_id` = '1'
AND `equipment`.`equip_is_deactivated` = 0
ORDER BY `equipment`.`equip_id` DESC
---
    public function fetch_user_component() {
        return $this->db->table('component')
                        ->select('component.component_id, component.component_code, component.component_designation,'
                                . 'equipment.equip_id, equipment.equip_code, equipment.equip_designation, cost_center_id, cost_center_code, cost_center_designation, '
                                . 'branch_id, branch_code, branch_designation, sector_id, sector_code, sector_designation ')
                        ->join('equipment', 'equipment.equip_id = component.component_id', 'inner')
                        ->join('cost_center', 'cost_center.cost_center_id = equipment.equip_cost_center_id', 'inner')
                        ->join('user_cost_center', 'user_cost_center.user_cost_center_cost_center_id = equipment.equip_cost_center_id', 'inner')
                        ->join('branch', 'cost_center.cost_center_branch_id = branch.branch_id', 'inner')
                        ->join('sector', 'sector.sector_parent_id = branch.branch_sector_id', 'inner')
                        ->where("user_cost_center.user_cost_center_user_id", $this->session->get("user_id"))
                        ->where("equipment.company_id", $this->session->get("user_company_id"))
                        ->where("equipment.equip_is_deactivated", 0)
                        ->orderBy('equipment.equip_id', 'desc')
                        ->get()->getResult();

SELECT DISTINCT `member`.*
FROM `member`
INNER JOIN `member_cost_center` ON `member`.`member_id` = `member_cost_center`.`member_cost_center_member_id`
WHERE `member_cost_center_cost_center_id` IN (SELECT `user_cost_center_cost_center_id` FROM `user_cost_center` WHERE `user_cost_center_user_id` = '1')
AND `member`.`member_is_deactivated` = 0
ORDER BY `member`.`member_id` DESC
---
    public function fetch_user_member() {
        $subQuery = $this->db->table('user_cost_center')->select('user_cost_center_cost_center_id')->where('user_cost_center_user_id', $this->session->get("user_id"));
        return $this->db->table('member')
                        ->select('member.*')->distinct()
                        ->join('member_cost_center', 'member.member_id = member_cost_center.member_cost_center_member_id', 'inner')
                        ->whereIn('member_cost_center_cost_center_id', $subQuery)
                        ->where("member.member_is_deactivated", 0)
                        ->orderBy('member.member_id', 'desc')
                        ->get()->getResult();